export const catalogMenu = [
  {
    name: "Сетевое оборудование",
    id: 1,
    subLinks: [
      {
        name: "Коммутаторы",
        _id: 101,
        links: [
          { id: 1001, name: "Фиксированные коммутаторы" },
          { id: 1002, name: "Коммутаторы Fibre Channel" },
          { id: 1003, name: "Модульные коммутаторы" },
          { id: 1004, name: "Bare metal коммутаторы" },
          { id: 1005, name: "Аксессуары для коммутаторов" },
        ],
      },
      {
        name: "Маршрутизаторы",
        _id: 102,
        links: [
          { id: 1006, name: "Маршрутизаторы для корпоративных клиентов" },
          { id: 1007, name: "Маршрутизаторы для домашнего использования" },
          { id: 1008, name: "Маршрутизаторы для провайдеров услуг связи" },
          { id: 1009, name: "Аксессуары для маршрутизаторов" },
          { id: 1010, name: "Блоки питания для маршрутизаторов" },
        ],
      },
      {
        name: "Медиаконвертеры",
        _id: 103,
        links: [
          { id: 1011, name: "Медиаконвертеры 1Gb" },
          { id: 1012, name: "Медиаконвертеры 100mb" },
          { id: 1013, name: "Медиаконвертеры 10G" },
          { id: 1014, name: "Блоки питания медиаконвертеров" },
        ],
      },
      {
        name: "Сервисные Шлюзы",
        _id: 104,
        links: [
          { id: 1015, name: "Межсетевые экраны" },
          { id: 1016, name: "Сервисные шлюзы для операторов связи" },
          { id: 1017, name: "Медиаконвертеры 100mb" },
          { id: 1018, name: "Медиаконвертеры 10G" },
          { id: 1019, name: "Блоки питания медиаконвертеров" },
        ],
      },
    ],
  },
  {
    name: "Серверы и СХД",
    id: 2,
    subLinks: [
      {
        name: "Серверы",
        _id: 201,
        links: [
          { id: 2001, name: "Стоечные серверы" },
          { id: 2002, name: "Российские серверы" },
          { id: 2003, name: "Башенные серверы" },
          { id: 2004, name: "Блейд серверы" },
          { id: 2005, name: "Промышленные серверы" },
          { id: 2006, name: "Модульные серверы" }, // Example addition
        ],
      },
      {
        name: "Комплектующие для серверов и СХД",
        _id: 202,
        links: [
          { id: 2007, name: "Процессоры для сервера" },
          { id: 2008, name: "Сетевые карты" },
          { id: 2009, name: "Аксессуары и адаптеры для сервера" },
          { id: 2010, name: "Серверная оперативная память" },
          { id: 2011, name: "Контроллеры дисков" },
          { id: 2012, name: "Серверные SSD" }, // Example addition
          { id: 2013, name: "Блоки питания для сервера" },
        ],
      },
      {
        name: "Системы хранения данных",
        _id: 203,
        links: [
          { id: 2014, name: "Дисковые массивы" },
          { id: 2015, name: "Дисковые полки" },
          { id: 2016, name: "Модули и переходники для СХД серверов" },
          { id: 2017, name: "Российские дисковые массивы" },
        ],
      },
      {
        name: "Кабели для серверов",
        _id: 204,
        links: [
          { id: 2018, name: "Серверные кабели и переходники" },
          { id: 2019, name: "Оптические кабели для серверов" },
          { id: 2020, name: "Патч-корды для серверов" },
        ],
      },
    ],
  },
  {
    name: "Системы оптического транспорта, xWDM, xPON",
    id: 3,
    subLinks: [
      {
        name: "SFP, GBIC, XFP, SFP+, X2, XENPAK, QSFP+, CFP модули",
        _id: 301,
        links: [
          { id: 3001, name: "Модули SFP" },
          { id: 3002, name: "Модули SFP+" },
          { id: 3003, name: "Модули SFP28" },
          { id: 3004, name: "Модули QSFP+" },
        ],
      },
      {
        name: "Уплотнение CWDM/DWDM",
        _id: 302,
        links: [
          { id: 3005, name: "Мультиплексоры/демультиплексоры (MUX/DMUX)" },
          { id: 3006, name: "Модули оптического уплотнения и фильтры" },
          { id: 3007, name: "Мультиплексоры ввода/вывода (OADM)" },
        ],
      },
    ],
  },
  {
    name: "Кабельная продукция, СКС и компоненты ВОЛС",
    id: 4,
    subLinks: [
      {
        name: "Оптический кабель",
        _id: 401,
        links: [
          { id: 4001, name: "Кабель оптический FTTH/FTTx" },
          { id: 4002, name: "Кабель оптический подвесной ADSS" },
        ],
      },
      {
        name: "Кабель витая пара",
        _id: 402,
        links: [
          { id: 4003, name: "LANsens" },
          { id: 4004, name: "EWS" },
          { id: 4005, name: "NETKO" },
          { id: 4006, name: "Hyperline" },
        ],
      },
    ],
  },
  {
    name: "Инженерная инфраструктура, ЦОД",
    id: 5,
    subLinks: [
      {
        name: "Шкафы телекоммуникационные",
        _id: 501,
        links: [
          { id: 5001, name: "Напольные телекоммуникационные шкафы" },
          { id: 5002, name: "Настенные шкафы телекоммуникационные" },
        ],
      },
      {
        name: "Климатичeское оборудование",
        _id: 502,
        links: [
          { id: 5003, name: "Кондиционеры встраиваемые" },
          { id: 5004, name: "Модули вентиляторные" },
        ],
      },
    ],
  },
  {
    name: "Серверы и СХД",
    id: 2,
    subLinks: [
      {
        name: "Серверы",
        _id: 201,
        links: [
          { id: 2001, name: "Стоечные серверы" },
          { id: 2002, name: "Российские серверы" },
          { id: 2003, name: "Башенные серверы" },
          { id: 2004, name: "Блейд серверы" },
          { id: 2005, name: "Промышленные серверы" },
          { id: 2006, name: "Модульные серверы" }, // Example addition
        ],
      },
      {
        name: "Комплектующие для серверов и СХД",
        _id: 202,
        links: [
          { id: 2007, name: "Процессоры для сервера" },
          { id: 2008, name: "Сетевые карты" },
          { id: 2009, name: "Аксессуары и адаптеры для сервера" },
          { id: 2010, name: "Серверная оперативная память" },
          { id: 2011, name: "Контроллеры дисков" },
          { id: 2012, name: "Серверные SSD" }, // Example addition
          { id: 2013, name: "Блоки питания для сервера" },
        ],
      },
      {
        name: "Системы хранения данных",
        _id: 203,
        links: [
          { id: 2014, name: "Дисковые массивы" },
          { id: 2015, name: "Дисковые полки" },
          { id: 2016, name: "Модули и переходники для СХД серверов" },
          { id: 2017, name: "Российские дисковые массивы" },
        ],
      },
      {
        name: "Кабели для серверов",
        _id: 204,
        links: [
          { id: 2018, name: "Серверные кабели и переходники" },
          { id: 2019, name: "Оптические кабели для серверов" },
          { id: 2020, name: "Патч-корды для серверов" },
        ],
      },
    ],
  },
  
  {
    name: "Системы оптического транспорта, xWDM, xPON",
    id: 3,
    subLinks: [
      {
        name: "SFP, GBIC, XFP, SFP+, X2, XENPAK, QSFP+, CFP модули",
        _id: 301,
        links: [
          { id: 3001, name: "Модули SFP" },
          { id: 3002, name: "Модули SFP+" },
          { id: 3003, name: "Модули SFP28" },
          { id: 3004, name: "Модули QSFP+" },
          { id: 3005, name: "Модули QSFP28" },
          { id: 3006, name: "Модули OSFP" },
          { id: 3007, name: "Модули CFP/CFP2/CFP4" },
          { id: 3008, name: "Модули XFP" },
          { id: 3009, name: "Модули QSFP-DD" },
        ],
      },
      {
        name: "Уплотнение CWDM/DWDM",
        _id: 302,
        links: [
          { id: 3010, name: "Мультиплексоры/демультиплексоры (MUX/DMUX)" },
          { id: 3011, name: "Модули оптического уплотнения и фильтры" },
          { id: 3012, name: "Мультиплексоры ввода/вывода (OADM)" },
          { id: 3013, name: "Транспортная WDM платформа" },
          { id: 3014, name: "Транспондеры (OEO)" },
          { id: 3015, name: "Усилители (EDFA)" },
          { id: 3016, name: "Компенсаторы дисперсии (DCM)" },
        ],
      },
      {
        name: "GPON & GEPON",
        _id: 303,
        links: [
          { id: 3017, name: "Станционные терминалы (OLT)" },
          { id: 3018, name: "Абонентские устройства (ONT/ONU)" },
          { id: 3019, name: "Делители оптические" },
          { id: 3020, name: "Оптические розетки и распределительные коробки" },
        ],
      },
    ],
  },
  
  {
    name: "Кабельная продукция, СКС и компоненты ВОЛС",
    id: 4,
    subLinks: [
      {
        name: "Оптический кабель",
        _id: 401,
        links: [
          { id: 4001, name: "Кабель оптический FTTH/FTTx" },
          { id: 4002, name: "Кабель оптический подвесной ADSS" },
          { id: 4003, name: "Кабель оптический подвесной, тип-8" },
          { id: 4004, name: "Кабель оптический в грунт" },
          { id: 4005, name: "Кабель оптический распределительный" },
          { id: 4006, name: "Распродажа оптического кабеля" },
          { id: 4007, name: "Кабель оптический в канализацию" },
          { id: 4008, name: "Кабель оптический огнестойкий" },
          { id: 4009, name: "Кабель оптический для пневмозадувки" },
        ],
      },
      {
        name: "Кабель витая пара",
        _id: 402,
        links: [
          { id: 4010, name: "LANsens" },
          { id: 4011, name: "EWS" },
          { id: 4012, name: "NETKO" },
          { id: 4013, name: "Hyperline" },
          { id: 4014, name: "NIKOLAN" },
          { id: 4015, name: "NETLAN" },
          { id: 4016, name: "Ubiquiti" },
        ],
      },
      {
        name: "Компоненты оптических систем",
        _id: 403,
        links: [
          { id: 4017, name: "FTTH коробки распределительные" },
          { id: 4018, name: "Патч-корды оптические" },
          { id: 4019, name: "Муфты оптические" },
          { id: 4020, name: "Кроссы оптические" },
          { id: 4021, name: "Крепления для оптического кабеля" },
          { id: 4022, name: "Адаптеры оптические" },
          { id: 4023, name: "Коннекторы оптические" },
          { id: 4024, name: "MPO/MTP разъёмы оптические" },
          { id: 4025, name: "Аттенюаторы оптические" },
          { id: 4026, name: "Аксессуары для компонентов оптических систем" },
        ],
      },
      {
        name: "Компоненты структурированных кабельных систем (СКС)",
        _id: 404,
        links: [
          { id: 4027, name: "Патч-корды коммутационные шнуры" },
          { id: 4028, name: "Аксессуары СКС" },
          { id: 4029, name: "Кроссовое оборудование" },
          { id: 4030, name: "Патч-панели коммутационные" },
          { id: 4031, name: "Органайзеры кабельные" },
          { id: 4032, name: "Розетки компьютерные" },
          { id: 4033, name: "Коннекторы для кабеля" },
          { id: 4034, name: "Модули Keystone" },
          { id: 4035, name: "Кабеленесущие системы" },
          { id: 4036, name: "Распродажа элементов СКС" },
          { id: 4037, name: "Грозозащита, молниезащита" },
        ],
      },
      {
        name: "Аксессуары для СКС (Материалы для монтажа)",
        _id: 405,
        links: [
          { id: 4038, name: "Изделия крепежные для кабеля" },
          { id: 4039, name: "Лотки металлические" },
          { id: 4040, name: "ПВХ Кабель канал" },
          { id: 4041, name: "Распродажа аксессуаров для монтажа СКС" },
        ],
      },
      {
        name: "Коаксиальный кабель",
        _id: 406,
        links: [
          { id: 4042, name: "REXANT" },
        ],
      },
      {
        name: "Электрический кабель",
        _id: 407,
        links: [
          { id: 4043, name: "Кабель гибкий" },
          { id: 4044, name: "Кабель силовой" },
          { id: 4045, name: "Кабель неизолированный" },
          { id: 4046, name: "Арматура для СИП" },
          { id: 4047, name: "Провод установочный" },
        ],
      },
    ],
  },
  {
    name: "Инженерная инфраструктура, ЦОД",
    id: 5,
    subLinks: [
      {
        name: "Шкафы телекоммуникационные",
        _id: 501,
        links: [
          { id: 5001, name: "Напольные телекоммуникационные шкафы" },
          { id: 5002, name: "Настенные шкафы телекоммуникационные" },
          { id: 5003, name: "Климатические телекоммуникационные шкафы" },
          { id: 5004, name: "Антивандальные телекоммуникационные шкафы" },
          { id: 5005, name: "Стойки монтажные" },
          { id: 5006, name: "Щиты распределительные, корпуса" },
          { id: 5007, name: "Полки в телекоммуникационный шкаф" },
          { id: 5008, name: "Аксессуары для телекоммуникационных шкафов" },
          { id: 5009, name: "Распродажа телекоммуникационных шкафов" },
        ],
      },
      {
        name: "Климатичeское оборудование",
        _id: 502,
        links: [
          { id: 5010, name: "Кондиционеры встраиваемые" },
          { id: 5011, name: "Модули вентиляторные" },
          { id: 5012, name: "Блоки вентиляторов" },
          { id: 5013, name: "Обогреватели" },
          { id: 5014, name: "Вентиляторы" },
          { id: 5015, name: "Термостаты" },
        ],
      },
      {
        name: "Дата Центр",
        _id: 503,
        links: [
          { id: 5016, name: "Мобильный ЦОД" },
          { id: 5017, name: "Серверные шкафы" },
        ],
      },
      {
        name: "Распродажа инженерной инфраструктуры и ЦОД",
        _id: 504,
        links: [
          { id: 5018, name: "SNR" },
          { id: 5019, name: "Metal Box" },
          { id: 5020, name: "SILART" },
        ],
      },
    ],
  }
  
  
];
